OpenFoam/validation1rod/AppENOFLOW/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    LeftWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          5000;
        startFace       9850;
    }
    RightWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          5000;
        startFace       14850;
    }
    Inlet
    {
        type            patch;
        nFaces          50;
        startFace       19850;
    }
    Outlet
    {
        type            patch;
        nFaces          50;
        startFace       19900;
    }
    Outterwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       19950;
    }
    fluid_to_cencil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       20050;
    }
)

// ************************************************************************* //
