OpenFoam/validation1rod/AppENOFLOW/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.7;

boundaryField
{   

   Inlet         { type totalTemperature; T0 uniform 293.7; gamma 1.4; }
   Outlet        { type zeroGradient; }
   Outterwall    { type zeroGradient; } 
   "fluid_to_.*" { type zeroGradient; }
   ".*Wedge"     { type wedge; }
}

